Запрос.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><UsernameToken><Username>PASSPORT_USER</Username><Password>*****</Password></UsernameToken></Security></SOAP-ENV:Header><SOAP-ENV:Body><register_request xmlns="http://gisun.agatsystem.by/common/ws/"><cover><message_id xmlns="http://gisun.agatsystem.by/common/types/">{2FF18271-7D3A-47D7-9B10-2A6ED1828E2B}</message_id><message_type xmlns="http://gisun.agatsystem.by/common/types/"><code>0001</code><type>82</type></message_type><message_time xmlns="http://gisun.agatsystem.by/common/types/">2020-10-23T16:53:58.595+03:00</message_time><message_source xmlns="http://gisun.agatsystem.by/common/types/"><code>1</code><type>80</type></message_source></cover><request><person_request><request_id>{8EE5CA6F-4621-4569-9132-286DF0AF48FA}</request_id><identif_number>4101283A081PB4</identif_number><document/></person_request></request></register_request></SOAP-ENV:Body></SOAP-ENV:Envelope>
