Запрос_Авест/Запрос.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><UsernameToken><Username>PRN11</Username><Password>*****</Password></UsernameToken><Sign>MIIJJQYJKoZIhvcNAQcCoIIJFjCCCRICAQExDzANBgkqcAACACJlH1EFADCCAt4GCSqGSIb3DQEH
AaCCAs8EggLLPHJlZ2lzdGVyX3JlcXVlc3QgeG1sbnM9Imh0dHA6Ly9naXN1bi5hZ2F0c3lzdGVt
LmJ5L2NvbW1vbi93cy8iPjxjb3Zlcj48bWVzc2FnZV9pZCB4bWxucz0iaHR0cDovL2dpc3VuLmFn
YXRzeXN0ZW0uYnkvY29tbW9uL3R5cGVzLyI+ezY1OTUwQzk1LUIyMTAtNEQ5RC1CMTUyLURENzFE
NTQ3MEJCNn08L21lc3NhZ2VfaWQ+PG1lc3NhZ2VfdHlwZSB4bWxucz0iaHR0cDovL2dpc3VuLmFn
YXRzeXN0ZW0uYnkvY29tbW9uL3R5cGVzLyI+PGNvZGU+MDMwMDwvY29kZT48dHlwZT44MjwvdHlw
ZT48L21lc3NhZ2VfdHlwZT48bWVzc2FnZV90aW1lIHhtbG5zPSJodHRwOi8vZ2lzdW4uYWdhdHN5
c3RlbS5ieS9jb21tb24vdHlwZXMvIj4yMDIwLTAxLTMxVDA5OjE3OjI4Ljg5NyswMzowMDwvbWVz
c2FnZV90aW1lPjxtZXNzYWdlX3NvdXJjZSB4bWxucz0iaHR0cDovL2dpc3VuLmFnYXRzeXN0ZW0u
YnkvY29tbW9uL3R5cGVzLyI+PGNvZGU+MTM3MzY8L2NvZGU+PHR5cGU+ODA8L3R5cGU+PC9tZXNz
YWdlX3NvdXJjZT48L2NvdmVyPjxyZXF1ZXN0PjxwZXJzb25fcmVxdWVzdD48cmVxdWVzdF9pZD57
NTNGMTU1M0UtNkI1NC00NzhCLTgzMUItRjhFRUU2OTc5NjlBfTwvcmVxdWVzdF9pZD48aWRlbnRp
Zl9udW1iZXI+MzA4MDE2M0MwMDBQQjc8L2lkZW50aWZfbnVtYmVyPjxkb2N1bWVudC8+PC9wZXJz
b25fcmVxdWVzdD48L3JlcXVlc3Q+PC9yZWdpc3Rlcl9yZXF1ZXN0PqCCA6UwggOhMIIDW6ADAgEC
AgxA5V4X3kG5XwAJ5OowDQYJKnAAAgAiZS0MBQAwggGWMYGjMIGgBgNVBAoegZgEIAQ1BEEEPwRD
BDEEOwQ4BDoEMAQ9BEEEOgQ+BDUAIARDBD0EOARCBDAEQAQ9BD4ENQAgBD8EQAQ1BDQEPwRABDgE
TwRCBDgENQAgACIEHQQwBEYEOAQ+BD0EMAQ7BEwEPQRLBDkAIARGBDUEPQRCBEAAIARNBDsENQQ6
BEIEQAQ+BD0EPQRLBEUAIARDBEEEOwRDBDMAIjFhMF8GA1UEAx5YBCAENQRBBD8EQwQxBDsEOAQ6
BDAEPQRBBDoEOAQ5ACAEQwQ0BD4EQQRCBD4EMgQ1BEAETwROBEkEOAQ5ACAERgQ1BD0EQgRAACAE
EwQ+BEEEIQQjBB4EGjELMAkGA1UEBhMCQlkxFzAVBgNVBAgeDgQcBDgEPQRBBDoEMARPMRkwFwYD
VQQHHhAEMwAuACAEHAQ4BD0EQQQ6MSswKQYDVQQJHiIEPwRAAC0EQgAgBBwEMARIBDUEQAQ+BDIE
MAAsACAAMgA1MR0wGwYJKoZIhvcNAQkBFg5yY2FAcGtpLmdvdi5ieTAeFw0xOTEwMjIxNDU0MDRa
Fw0yMDA0MjEyMDU5NTlaMGwxHDAaBgNVBAMME9Ci0LXRgdGC0L7QsiDQoi7Qoi4xFTATBgNVBAQM
DNCi0LXRgdGC0L7QsjEPMA0GA1UEKQwG0KIu0KIuMRcwFQYDVQQFEw4xMTExMTExMTExMTExMTEL
MAkGA1UEBhMCQlkwXTAYBgoqcAACACJlLQIBBgoqcAACACJlLQMBA0EAAN4ezZCRaYHOWwsv3sRj
0ttY4JPrgqeToalux1dqL8iUXg+vWtWInaIMIif/nB+mkCoQnXYbhogt65zE40V4gqOBrzCBrDAf
BgNVHSMEGDAWgBQ5XoDV5NkcWT2GV3SnnNW9QX07gDAJBgNVHRMEAjAAMB0GA1UdDgQWBBTLG5/I
HvSBOb7t8tHdDT1mRr5m6TALBgNVHQ8EBAMCA+gwEwYDVR0lBAwwCgYIKwYBBQUHAwIwPQYJKnAB
AgEBAQIBBDAeLgAxAC4AMgAuADEAMQAyAC4AMQAuADIALgAxAC4AMQAuADEALgAyAC4AMQAuADUw
DQYJKnAAAgAiZS0MBQADMQDkxDdAkgXoMO2s4lJn2q9bPfq4g5mHSmNIFk+r/l2d6L1nsEQ7vPfS
xKQ66osuskgxggJvMIICawIBATCCAagwggGWMYGjMIGgBgNVBAoegZgEIAQ1BEEEPwRDBDEEOwQ4
BDoEMAQ9BEEEOgQ+BDUAIARDBD0EOARCBDAEQAQ9BD4ENQAgBD8EQAQ1BDQEPwRABDgETwRCBDgE
NQAgACIEHQQwBEYEOAQ+BD0EMAQ7BEwEPQRLBDkAIARGBDUEPQRCBEAAIARNBDsENQQ6BEIEQAQ+
BD0EPQRLBEUAIARDBEEEOwRDBDMAIjFhMF8GA1UEAx5YBCAENQRBBD8EQwQxBDsEOAQ6BDAEPQRB
BDoEOAQ5ACAEQwQ0BD4EQQRCBD4EMgQ1BEAETwROBEkEOAQ5ACAERgQ1BD0EQgRAACAEEwQ+BEEE
IQQjBB4EGjELMAkGA1UEBhMCQlkxFzAVBgNVBAgeDgQcBDgEPQRBBDoEMARPMRkwFwYDVQQHHhAE
MwAuACAEHAQ4BD0EQQQ6MSswKQYDVQQJHiIEPwRAAC0EQgAgBBwEMARIBDUEQAQ+BDIEMAAsACAA
MgA1MR0wGwYJKoZIhvcNAQkBFg5yY2FAcGtpLmdvdi5ieQIMQOVeF95BuV8ACeTqMA0GCSpwAAIA
ImUfUQUAoGkwGAYJKoZIhvcNAQkDMQsGCSqGSIb3DQEHATAcBgkqhkiG9w0BCQUxDxcNMjAwMTMx
MDYxNzQ1WjAvBgkqhkiG9w0BCQQxIgQgi/g6FbO2FHz+6J2u1tRoZVVXRxGO9Uz05sTguT+DzSow
DgYKKnAAAgAiZS0CAQUABDAN1JJu38dXogRAEkgXwK78lJjKh74zW3KecnYBmHT3ysIdk+0ttZOv
dt3Sh5rojp8=</Sign><Key>MIIDoTCCA1ugAwIBAgIMQOVeF95BuV8ACeTqMA0GCSpwAAIAImUtDAUAMIIBljGBozCBoAYDVQQK
HoGYBCAENQRBBD8EQwQxBDsEOAQ6BDAEPQRBBDoEPgQ1ACAEQwQ9BDgEQgQwBEAEPQQ+BDUAIAQ/
BEAENQQ0BD8EQAQ4BE8EQgQ4BDUAIAAiBB0EMARGBDgEPgQ9BDAEOwRMBD0ESwQ5ACAERgQ1BD0E
QgRAACAETQQ7BDUEOgRCBEAEPgQ9BD0ESwRFACAEQwRBBDsEQwQzACIxYTBfBgNVBAMeWAQgBDUE
QQQ/BEMEMQQ7BDgEOgQwBD0EQQQ6BDgEOQAgBEMENAQ+BEEEQgQ+BDIENQRABE8ETgRJBDgEOQAg
BEYENQQ9BEIEQAAgBBMEPgRBBCEEIwQeBBoxCzAJBgNVBAYTAkJZMRcwFQYDVQQIHg4EHAQ4BD0E
QQQ6BDAETzEZMBcGA1UEBx4QBDMALgAgBBwEOAQ9BEEEOjErMCkGA1UECR4iBD8EQAAtBEIAIAQc
BDAESAQ1BEAEPgQyBDAALAAgADIANTEdMBsGCSqGSIb3DQEJARYOcmNhQHBraS5nb3YuYnkwHhcN
MTkxMDIyMTQ1NDA0WhcNMjAwNDIxMjA1OTU5WjBsMRwwGgYDVQQDDBPQotC10YHRgtC+0LIg0KIu
0KIuMRUwEwYDVQQEDAzQotC10YHRgtC+0LIxDzANBgNVBCkMBtCiLtCiLjEXMBUGA1UEBRMOMTEx
MTExMTExMTExMTExCzAJBgNVBAYTAkJZMF0wGAYKKnAAAgAiZS0CAQYKKnAAAgAiZS0DAQNBAADe
Hs2QkWmBzlsLL97EY9LbWOCT64Knk6GpbsdXai/IlF4Pr1rViJ2iDCIn/5wfppAqEJ12G4aILeuc
xONFeIKjga8wgawwHwYDVR0jBBgwFoAUOV6A1eTZHFk9hld0p5zVvUF9O4AwCQYDVR0TBAIwADAd
BgNVHQ4EFgQUyxufyB70gTm+7fLR3Q09Zka+ZukwCwYDVR0PBAQDAgPoMBMGA1UdJQQMMAoGCCsG
AQUFBwMCMD0GCSpwAQIBAQECAQQwHi4AMQAuADIALgAxADEAMgAuADEALgAyAC4AMQAuADEALgAx
AC4AMgAuADEALgA1MA0GCSpwAAIAImUtDAUAAzEA5MQ3QJIF6DDtrOJSZ9qvWz36uIOZh0pjSBZP
q/5dnei9Z7BEO7z30sSkOuqLLrJI</Key><Hash></Hash><SignDate>2020-01-31T09:17:46</SignDate></Security></SOAP-ENV:Header><SOAP-ENV:Body><register_request xmlns="http://gisun.agatsystem.by/common/ws/"><cover><message_id xmlns="http://gisun.agatsystem.by/common/types/">{65950C95-B210-4D9D-B152-DD71D5470BB6}</message_id><message_type xmlns="http://gisun.agatsystem.by/common/types/"><code>0300</code><type>82</type></message_type><message_time xmlns="http://gisun.agatsystem.by/common/types/">2020-01-31T09:17:28.897+03:00</message_time><message_source xmlns="http://gisun.agatsystem.by/common/types/"><code>13736</code><type>80</type></message_source></cover><request><person_request><request_id>{53F1553E-6B54-478B-831B-F8EEE697969A}</request_id><identif_number>3080163C000PB7</identif_number><document/></person_request></request></register_request></SOAP-ENV:Body></SOAP-ENV:Envelope>
